app/views/desdobramentos/_form.html.erb

        <%if @desdobramento.tipo and @desdobramento.tipo=="Ocorrencia"%>
        <%= f.input :tipo_ocorrencia_id, collection: TipoOcorrencia.order([:descricao]), :label=>"Tipo de Ocorrência", label_method: :descricao, value_method: :id, include_blank: true, :input_html => {:value => (@desdobramento.tipo_ocorrencia if @desdobramento.tipo_ocorrencia)} %>
---
SELECT "tipo_ocorrencias".* FROM "tipo_ocorrencias"  ORDER BY "tipo_ocorrencias"."descricao" ASC