app/views/pessoas/show.html.erb

SELECT "contatos".* FROM "contatos" WHERE "contatos"."pessoa_id" = $1  [["pessoa_id", 4]]
---
  <strong>Contatos:</strong>
  <% @pessoa.contatos.each do |c| %>