app/views/tipo_desdobramentos/_form.html.erb

  <div class="form-inputs">
    <%= f.association :desdobramento, collection: Desdobramento.order([:descricao]), :label=>"Desdobramento", label_method: :descricao_completa, value_method: :id, include_blank: false %>
---
SELECT "desdobramentos".* FROM "desdobramentos"  ORDER BY "desdobramentos"."descricao" ASC