app/views/usuarios/new.html.erb


  <%=
    #f.association :escola, collection: Escola.order([:nome]), :label=>"Escola", label_method: :nome, value_method: :id, include_blank: true
---
SELECT "escolas".* FROM "escolas"  ORDER BY "escolas"."nome" ASC

  <% if can? :manage, Role %>
    <%= f.input :role_ids, :label=>"Permissões", :collection=>Role.accessible_by(current_ability).order('nome ASC').collect {|d| [d.nome, d.id]}, as: :check_boxes %>
---
SELECT  "roles".* FROM "roles" WHERE "roles"."nome" = $1  ORDER BY "roles"."id" ASC LIMIT 1  [["nome", "MASTER"]]