app/controllers/desdobramentos_controller.rb

SELECT  "desdobramentos".* FROM "desdobramentos"  ORDER BY created_at ASC LIMIT 10 OFFSET 0
---
  def index
    #@desdobramentos = Desdobramento.all
    @q = Desdobramento.ransack(params[:q])
    @desdobramentos = @q.result.accessible_by(current_ability).order('created_at ASC').paginate(:page => params[:page], :per_page => @@per_page)

INSERT INTO "desdobramentos" ("descricao", "tipo_ocorrencia_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["descricao", "primeiro desdobramento ocorrencia"], ["tipo_ocorrencia_id", 1], ["created_at", "2016-03-10 15:43:08.665145"], ["updated_at", "2016-03-10 15:43:08.665145"]]
---
  def create
    @desdobramento = Desdobramento.new(desdobramento_params)

    respond_to do |format|
      if @desdobramento.save

UPDATE "desdobramentos" SET "descricao" = $1, "tipo_ocorrencia_id" = $2, "tipo_agressor_id" = $3, "updated_at" = $4 WHERE "desdobramentos"."id" = $5  [["descricao", "primeiro desdobramento agressor"], ["tipo_ocorrencia_id", nil], ["tipo_agressor_id", 1], ["updated_at", "2016-03-10 15:43:54.524286"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @desdobramento.update(desdobramento_params)

SELECT  "desdobramentos".* FROM "desdobramentos" WHERE "desdobramentos"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_desdobramento
      @desdobramento = Desdobramento.find(params[:id])