app/controllers/encaminhamentos_controller.rb

SELECT  "encaminhamentos".* FROM "encaminhamentos"  ORDER BY descricao ASC LIMIT 2 OFFSET 0
---
  def index
    #@encaminhamentos = Encaminhamento.all
    @q = Encaminhamento.ransack(params[:q])
    @encaminhamentos = @q.result.accessible_by(current_ability).order('descricao ASC').paginate(:page => params[:page], :per_page => @@per_page)

INSERT INTO "encaminhamentos" ("descricao", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["descricao", "1 Encaminhamento de Teste"], ["created_at", "2016-03-02 14:18:32.351457"], ["updated_at", "2016-03-02 14:18:32.351457"]]
---
  def create
    @encaminhamento = Encaminhamento.new(encaminhamento_params)

    respond_to do |format|
      if @encaminhamento.save

SELECT  "encaminhamentos".* FROM "encaminhamentos" WHERE "encaminhamentos"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_encaminhamento
      @encaminhamento = Encaminhamento.find(params[:id])