app/controllers/escolas_controller.rb

  def index
    #@escolas = Escola.all
    @q = Escola.ransack(params[:q])
    @escolas = @q.result.accessible_by(current_ability).order('nome ASC').paginate(:page => params[:page], :per_page => @@per_page)
---
SELECT  "escolas".* FROM "escolas"  ORDER BY nome ASC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "escolas"

  def create
    @escola = Escola.new(escola_params)

    respond_to do |format|
      if @escola.save
---
INSERT INTO "escolas" ("codigo", "nome", "cep", "numero", "email", "contato", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["codigo", "2"], ["nome", "escola 2"], ["cep", "2"], ["numero", ""], ["email", ""], ["contato", ""], ["created_at", "2016-03-07 12:27:56.659095"], ["updated_at", "2016-03-07 12:27:56.659095"]]

  def update
    respond_to do |format|
      if @escola.update(escola_params)
---
UPDATE "escolas" SET "nome" = $1, "updated_at" = $2 WHERE "escolas"."id" = $3  [["nome", "escola 1"], ["updated_at", "2016-03-02 13:37:31.770041"], ["id", 1]]

    def set_escola
      @escola = Escola.find(params[:id])
---
SELECT  "escolas".* FROM "escolas" WHERE "escolas"."id" = $1 LIMIT 1  [["id", 1]]