app/controllers/ocorrencias_controller.rb

  def index
    #@ocorrencias = Ocorrencia.all
    @q = Ocorrencia.ransack(params[:q])
    @ocorrencias = @q.result.accessible_by(current_ability).order('created_at DESC').paginate(:page => params[:page], :per_page => @@per_page)
---
SELECT  "ocorrencias".* FROM "ocorrencias"  ORDER BY created_at DESC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "ocorrencias"

  def autocomplete_pessoa_nome
    term = params[:term]
    pessoas = Pessoa.where('nome ilike ?',"%#{term}%").order(:nome).all
---
SELECT "pessoas".* FROM "pessoas" WHERE (nome ilike '%jo%')  ORDER BY "pessoas"."nome" ASC

  def edit
    @tipo_ocorrencia = @ocorrencia.tipo_ocorrencia
    @desdobramentos_tipo_ocorrencia = @tipo_ocorrencia.desdobramentos.collect{|t| [t.descricao, t.id]} if @tipo_ocorrencia
    @tipo_desdobramentos_ocorrencia = @ocorrencia.desdobramento_tipo_ocorrencia.tipo_desdobramentos.collect{|t| [t.descricao, t.id]} if @ocorrencia.desdobramento_tipo_ocorrencia
    @tipo_agressor = @ocorrencia.tipo_agressor
    @desdobramentos_tipo_agressor = @tipo_agressor.desdobramentos.collect{|t| [t.descricao, t.id]} if @tipo_agressor
---
SELECT "tipo_ocorrencias".* FROM "tipo_ocorrencias"  ORDER BY "tipo_ocorrencias"."descricao" ASC
SELECT "tipo_agressors".* FROM "tipo_agressors"  ORDER BY "tipo_agressors"."descricao" ASC

  def create
    @ocorrencia = Ocorrencia.new(ocorrencia_params)

    respond_to do |format|
      if @ocorrencia.save
---
INSERT INTO "ocorrencias" ("numero_protocolo", "sob_influencia", "encaminhamento_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["numero_protocolo", ""], ["sob_influencia", ""], ["encaminhamento_id", 1], ["created_at", "2016-03-02 14:20:06.391119"], ["updated_at", "2016-03-02 14:20:06.391119"]]

  def update
    respond_to do |format|
      if @ocorrencia.update(ocorrencia_params)
---
UPDATE "ocorrencias" SET "numero_protocolo" = $1, "sob_influencia" = $2, "updated_at" = $3 WHERE "ocorrencias"."id" = $4  [["numero_protocolo", "00000"], ["sob_influencia", "Álcool"], ["updated_at", "2016-03-02 16:02:38.676362"], ["id", 2]]

  def criar_pessoa
    @pessoa = Pessoa.new(pessoa_params)

    respond_to do |format|
      if @pessoa.save
---
INSERT INTO "pessoas" ("nome", "sexo", "raca", "escolaridade", "documento", "deficiente", "nome_responsavel", "cep", "numero", "complemento", "data_nascimento", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def desdobramento_tipo_ocorrencia
    if !params[:tipo_ocorrencia].blank?
      @tipo_ocorrencia = TipoOcorrencia.find(params[:tipo_ocorrencia])
      @desdobramentos = @tipo_ocorrencia.desdobramentos.collect{|t| [t.descricao, t.id]}
---
SELECT  "tipo_ocorrencias".* FROM "tipo_ocorrencias" WHERE "tipo_ocorrencias"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "desdobramentos".* FROM "desdobramentos" WHERE "desdobramentos"."tipo_ocorrencia_id" = $1  [["tipo_ocorrencia_id", 4]]
SELECT "tipo_ocorrencias".* FROM "tipo_ocorrencias"  ORDER BY "tipo_ocorrencias"."descricao" ASC

  def set_ocorrencia
    @ocorrencia = Ocorrencia.find(params[:id])
---
SELECT  "tipo_ocorrencias".* FROM "tipo_ocorrencias" WHERE "tipo_ocorrencias"."id" = $1 LIMIT 1  [["id", 1]]