app/controllers/pessoas_controller.rb

  def index
    #@pessoas = Pessoa.all
    @q = Pessoa.ransack(params[:q])
    @pessoas = @q.result.accessible_by(current_ability).order('nome ASC').paginate(:page => params[:page], :per_page => @@per_page)
---
SELECT  "pessoas".* FROM "pessoas" WHERE ("pessoas"."nome" ILIKE '%i%')  ORDER BY nome ASC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "pessoas"

  def create
    @pessoa = Pessoa.new(pessoa_params)

    respond_to do |format|
      if @pessoa.save
---
INSERT INTO "pessoas" ("nome", "sexo", "raca", "escolaridade", "tipo_documento", "numero_documento", "deficiente", "tipo_deficiencia", "nome_responsavel", "cep", "numero", "complemento", "data_nascimento", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"

  def update
    respond_to do |format|
      if @pessoa.update(pessoa_params)
---
UPDATE "pessoas" SET "sexo" = $1, "escolaridade" = $2, "documento" = $3, "tipo_documento" = $4, "tipo_deficiencia" = $5, "updated_at" = $6 WHERE "pessoas"."id" = $7  [["sexo", "M"], ["escolaridade", "Fundamental - Incompleto"], ["documento", "f"], ["tipo_documento", "RG"], ["tipo_deficiencia", "FISICA"], ["updated_at", "2016-02-26 13:54:58.811904"], ["id", 1]]

  def destroy
    @pessoa.destroy
---
DELETE FROM "pessoas" WHERE "pessoas"."id" = $1  [["id", 2]]

    def set_pessoa
      @pessoa = Pessoa.find(params[:id])
---
SELECT  "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = $1 LIMIT 1  [["id", 2]]