app/controllers/tipo_ocorrencias_controller.rb

SELECT  "tipo_ocorrencias".* FROM "tipo_ocorrencias"  ORDER BY descricao ASC LIMIT 2 OFFSET 0
---
  def index
    #@tipo_ocorrencias = TipoOcorrencia.all
    @q = TipoOcorrencia.ransack(params[:q])
    @tipo_ocorrencias = @q.result.accessible_by(current_ability).order('descricao ASC').paginate(:page => params[:page], :per_page => @@per_page)

INSERT INTO "tipo_ocorrencias" ("descricao", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["descricao", "tipo de ocorrencia 1"], ["created_at", "2016-03-02 14:39:22.967607"], ["updated_at", "2016-03-02 14:39:22.967607"]]
---
  def create
    @tipo_ocorrencia = TipoOcorrencia.new(tipo_ocorrencia_params)

    respond_to do |format|
      if @tipo_ocorrencia.save

SELECT  "tipo_ocorrencias".* FROM "tipo_ocorrencias" WHERE "tipo_ocorrencias"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_tipo_ocorrencia
      @tipo_ocorrencia = TipoOcorrencia.find(params[:id])