app/controllers/tipo_desdobramentos_controller.rb

  def index
    #@tipo_desdobramentos = TipoDesdobramento.all
    #@desdobramentos = Desdobramento.all
    @q = TipoDesdobramento.ransack(params[:q])
    @tipo_desdobramentos = @q.result.accessible_by(current_ability).order('created_at ASC').paginate(:page => params[:page], :per_page => @@per_page)
---
SELECT  "tipo_desdobramentos".* FROM "tipo_desdobramentos"  ORDER BY created_at ASC LIMIT 10 OFFSET 0

  def create
    @tipo_desdobramento = TipoDesdobramento.new(tipo_desdobramento_params)

    respond_to do |format|
      if @tipo_desdobramento.save
---
INSERT INTO "tipo_desdobramentos" ("descricao", "desdobramento_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["descricao", "1 tipo de desdobramento ocorrencia"], ["desdobramento_id", 1], ["created_at", "2016-03-11 12:51:55.742991"], ["updated_at", "2016-03-11 12:51:55.742991"]]

    def set_tipo_desdobramento
      @tipo_desdobramento = TipoDesdobramento.find(params[:id])
---
SELECT  "tipo_desdobramentos".* FROM "tipo_desdobramentos" WHERE "tipo_desdobramentos"."id" = $1 LIMIT 1  [["id", 1]]