app/controllers/usuarios_controller.rb

  def index
    #@usuarios = usuario.all
    #@usuarios = User.accessible_by(current_ability).order('name ASC')
    @q = User.ransack(params[:q])
    @usuarios = @q.result.accessible_by(current_ability).order('name ASC').paginate(:page => params[:page], :per_page => @@per_page)
---
SELECT  "users".* FROM "users"  ORDER BY name ASC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "users"

  def show
    @usuario = User.accessible_by(current_ability).find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]

  def autocomplete_escola_nome
    term = params[:term]
    escolas = Escola.where('nome ilike ?',"%#{term}%").order(:nome).all
---
SELECT "escolas".* FROM "escolas" WHERE (nome ilike '%es%')  ORDER BY "escolas"."nome" ASC

  def edit
    @usuario = User.accessible_by(current_ability).find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]

  def create
    @usuario = User.new(user_params)
    @usuario.ativo = true
    @usuario.mudar_senha = true

    respond_to do |format|
      if @usuario.save
---
INSERT INTO "users" ("name", "email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    @usuario = User.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
UPDATE "users" SET "cpf" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["cpf", "000.000.000.00"], ["updated_at", "2016-02-26 12:40:41.533501"], ["id", 3]]

  def destroy #  -----------------------------------> DESATIVAR / ATIVAR
    @usuario = User.find(params[:id])
    if @usuario.ativo == true
      @usuario.ativo = false
    else
      @usuario.ativo = true
    end
    if @usuario.save!
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
UPDATE "users" SET "ativo" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["ativo", "f"], ["updated_at", "2016-02-29 13:56:40.682549"], ["id", 5]]

  def redefinir_senha
    @usuario = User.find(params[:usuario_id])
    @usuario.mudar_senha = true
    @usuario.password = @usuario.password_confirmation = "12345678"
    if @usuario.save(:validate=>false)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$10$UxAuWruN5EeCwSlWJp6a0OgOmgeznVR7SKCviTnWt4kcD6xiXcbym"], ["updated_at", "2016-02-18 14:22:30.677763"], ["id", 4]]