app/views/ocorrencias/_form.html.erb

SELECT "tipo_ocorrencias".* FROM "tipo_ocorrencias"  ORDER BY "tipo_ocorrencias"."descricao" ASC
---

    <%= f.association :tipo_ocorrencia, collection: TipoOcorrencia.order([:descricao]), :label=>"Tipo de Ocorrência", label_method: :descricao, value_method: :id, include_blank: true, :input_html => {:id => "ocorrencia_tipo_ocorrencia", :value=>(@ocorrencia.tipo_ocorrencia.descricao if @ocorrencia.tipo_ocorrencia)} %>

SELECT "tipo_agressors".* FROM "tipo_agressors"  ORDER BY "tipo_agressors"."descricao" ASC
---

    <%= f.association :tipo_agressor, collection: TipoAgressor.order([:descricao]), :label=>"Tipo de Agressor", label_method: :descricao, value_method: :id, include_blank: false %>

SELECT "encaminhamentos".* FROM "encaminhamentos"  ORDER BY "encaminhamentos"."descricao" ASC
---

    <%= f.association :encaminhamento, collection: Encaminhamento.order([:descricao]), :label=>"Encaminhamento", label_method: :descricao, value_method: :id, include_blank: false %>